anywhere
has
got
to
be
a
better
place
than
here
thought
john
.
he
looked
down
at
the
razor
blade
in
his
right
hand
sharp
precise
pains
along
left
arm
held
him
from
depths
of
oppressive
sadness
had
been
very
careful
conceal
each
cuts
places
they
were
cut
pattern
others
was
just
chaos
but
no
matter
where
there
beautiful
crimson
blood
it
okay
make
none
too
deep
and
high
enough
up
covered
by
flannel
shirts
wore
winter
things
home
depressing
himself
keep
depression
continuing
its
downward
spiral
so
that
would
feel
anything
sad
empty
alone
|
only
after
many
sessions
this
ceremonial
mutilation
she
appeared
happened
late
one
night
father
mad
again
punched
hole
kitchen
wall
tore
off
into
like
an
angel
knew
wasnt
took
pain
replaced
with
wonderful
tingling
desire
know
who
are
you
stammered
answer
which
not
really
said
i
sensed
your
far
away
have
much
heart
could
longer
stand
come
take
me
will
adventures
cannot
even
imagine
show
powerful
rivers
wiej
rocket
towers
osfy
shining
saphires
shio
first
is
thing
must
ask
what
replied
point
nothing
do
for
her
adventure
all
intriguing
spoke
if
without
always
huge
aching
inside
never
filled
wanted
lose
myself
moment
met
follow
asked
spend
more
time
get
need
help
rescue
our
kingdom
rid
lands
dark
shadow
coming
my
land
people
because
talents
believe
hero
vanquish
darkness
yes
last
remembered
saying
definitely
affirmative
regret
how
hard
carry
out
request
hardship
fears
face
them
early
story
cover
details
sorrow
celebrate
told
tale
beginning
boy
infatuated
fairy
princess
girl
raised
pointed
palm
came
brightest
light
ever
seen
bright
vision
intense
white
also
head
lost
consciousness
awoke
on
sandy
shore
cold
sand
damp
dreamed
or
any
thoughts
simply
then
found
next
maybe
fell
asleep
dream
luckily
remaining
intensely
sadly
gone
as
tell
did
recognize
clothes
wearing
sweats
tennis
shoes
chance
changed
clothing
before
travel
great
backpack
tent
canteen
hiking
lighter
compass
back
mourning
their
lack
now
obvious
short
look
around
earth
anymore
sky
shade
purple
another
trees
moving
instead
branches
tentacles
waved
air
arms
sea
anemone
waving
ocean
currents
began
rain
least
seemed
water
glumly
sulfuric
acid
obviously
glad
meant
drink
survive
long
made
think
about
breathable
dead
suddenly
noticed
different
slightly
buzzing
feeling
when
taking
gas
dentist
office
actually
going
new
filling
something
nitrous
oxide
live
scared
little
intoxicating
might
easily
bad
judgement
call
life
jeopardy
unknown
environment
telling
already
moved
other
differences
bet
lot
money
surprises
store
care
returning
didnt
quickly
mother
miss
alright
rely
needed
sense
purpose
given
want
find
name
should
unsure
scouts
taught
two
survival
build
leanto
shelter
fire
trap
small
game
improvised
teach
planet
tinged
atmosphere
food
those
driving
principles
we
universe
unless
running
giant
sabre
toothed
flesh
eating
monster
way
run
sure
well
breathing
no2
experience
laughing
lying
dentists
chair
while
teeth
being
scraped
drilled
reduce
eventually
eaten
horrible
stay
tasting
whatever
salt
tides
low
go
sun
appear
moon
considering
options
decided
move
locate
allimportant
most
until
important
else
deciding
problem
rule
half
directions
looking
see
end
decision
pretty
easy
split
difference
middle
path
headed
straight
directly
inland
doubts
passing
approached
slowly
real
caution
terrible
imagined
massive
creatures
passed
tree
relieved
lash
attempt
grab
walked
accept
fact
couldnt
everything
fairly
consistent
weirdness
special
powers
fly
pinch
close
open
eyes
acted
reality
some
experiences
dreams
called
realization
knowledge
knowing
dreaming
usually
inconsistency
lurking
corners
sudden
shifts
perspective
jump
float
feather
hurt
worse
died
die
though
focus
mind
happening
over
vein
payed
attention
yet
same
still
ground
grass
overlooked
color
movement
smell
unfocussed
bit
almost
hike
woods
upon
stream
truth
knelt
clear
bottom
worn
rocks
pebbles
cautiously
dipped
tip
finger
felt
nice
cool
best
dissolve
bath
idea
dip
besides
probably
risky
brought
wet
under
nose
brief
sniff
fingertip
tongue
taste
hands
old
choose
army
bring
pick
guys
drank
putting
lips
surface
tzu
tao
te
ching
bible
remember
eye
surroundings
cautious
sip
tasted
good
spring
wouldnt
put
downstream
fed
upstream
reasoned
hour
clearing
behind
scary
dragons
swooping
scoop
engulfing
nest
full
baby
devour
midmorning
snack
shook
positive
otherwise
hide
crevice
somewhere
starve
death
several
hundred
yards
opening
saw
approaching
horizon
band
men
horseback
fast
kicking
quite
dust
immediately
contemplated
toward
wood
caught
wait
arrival
times
closer
less
reach
situation
became
dire
convinced
these
breaths
undone
worst
talk
become
arrived
between
horses
riding
6
legs
ugly
gaping
mouth
surrounded
hardly
once
thinking
hopeless
against
10
weapons
pointy
metallic
mean
sizes
projectile
weapon
lasers
phasers
laughed
immediate
universal
symbol
greeting
showed
unarmed
surprisingly
work
exactly
smiled
front
leader
turned
man
beside
return
understand
uncomfortable
laughter
normally
language
speaking
english
sounded
human
leaned
normal
guy
getting
swap
stories
lives
worlds
contact
rosetta
stone
quick
ship
edition
smile
three
grabbed
whips
lashed
react
done
playing
bullwhip
grandfathers
learn
crack
christmas
parade
every
year
house
hit
painful
whelps
badge
earned
friends
school
accidentally
hitting
trying
whip
having
3
grown
target
excruciating
scars
circle
entire
body
immobilized
wrapped
elbows
wrists
knees
practiced
particular
maneuver
since
birth
morning
day
mercy
falling
writhed
fall
writhe
hollering
hadnt
pissed
cried
comforting
hold
onto
piece
dignity
jumped
horse
holding
jerked
simultaneously
rolled
violently
across
freed
carefully
big
kind
animal
smelled
nasty
brute
wrist
pushed
sleeve
expected
known
primitive
tenderness
leaders
demeanor
somehow
shifted
florence
nightingale
read
danger
assuring
course
commit
atrocities
killing
tied
together
rope
recognized
happen
ride
hoped
able
walk
went
drag
cowboys
dragged
westerns
tv
fun
stirrups
apache
mounting
bareback
indians
group
started
talked
among
themselves
word
sound
stop
let
rest
why
set
mounts
during
break
tried
motions
suggest
tired
walking
seem
trust
wondering
strange
bridles
tack
rider
beast
conveying
through
touches
gripped
thighs
uncanny
telepathic
component
such
telepathy
meet
transported
world
protect
encroaching
either
travelling
village
distance
architecture
tepees
wigwams
caves
incredible
dwellings
combination
adobe
precious
gems
shaped
pueblos
built
team
gaudi
suess
lines
ornate
doors
openings
various
holes
arched
doorways
overly
paintings
elvis
black
velvet
athletically
dismounted
lead
shoulder
edge
building
buildings
gaudy
bigger
doorway
stepped
unkempt
hair
beard
reached
older
kidnapped
chief
witchdoctor
untied
motioning
castle
stood
plain
glorious
similar
tribal
la
sagrada
familia
woke
rose
warm
yellow
glow
bed
chambers
13
blue
thin
athletic
simple
dressing
gown
sat
slow
sensual
stretch
silver
bell
bedside
rang
heavier
curly
brown
hazel
servant
hope
pleasant
dont
concentrate
remembering
especially
ones
ruby
red
giggled
can
meeting
today
oh
anxious
laying
dress
garments
used
chamber
pot
helped
dressed
brushed
waiting
breakfast
youd
thank
marie
hurry
room
emptied
window
tidied
young
lived
stayed
busy
performing
duties
spent
doing
ladys
wash
cleaning
caring
ornamental
gardens
preparing
feast
days
king
hunt
rumor
successful
few
minutes
mid
afternoon
hurriedly
ran
shut
door
licked
deadbolt
allowed
lit
candle
wobbly
table
corner
dried
seed
pocked
placed
stared
concentrated
accident
invoking
turning
verge
loosing
psychokinesis
control
gift
heavy
served
reason
kept
secret
someone
discovered
taken
prison
forced
drill
perfect
art
enjoyed
freedom
week
pleased
hear
birds
meadow
feet
avoid
temptation
improve
skills
evening
task
bread
nights
meal
require
making
deal
fetched
starter
ruined
experimentation
managed
mixed
ingredients
batch
rise
batches
stages
rising
step
beating
dough
kneading
muscular
loved
release
loaf
sweet
wine
everyone
enjoying
tonight
please
respected
loaves
oven
mess
baked
crust
soft
inner
core
watched
worried
recently
visit
closely
cropped
flowers
medicine
hugged
bodies
tightly
embroidery
jewels
embellishments
tiny
machines
function
afraid
projectiles
push
button
person
drop
agony
missed
remove
chastised
herself
pulled
12
golden
eat
fresh
leftovers
workers
components
ready
roasted
beasts
platters
steaming
vegetables
casks
dessert
pudding
servers
relax
banter
interested
hunting
party
say
dared
strained
hearing
utmost
regal
loose
flowing
ornately
decorated
robes
freshly
combed
toast
announced
loudly
challenges
ahead
hall
deeply
challenge
sir
hanley
newcomers
technology
kill
distances
murmur
broke
clearly
concerned
wage
war
neighboring
swords
shields
bows
ruled
heavens
am
conflict
necessary
openly
attacked
us
ensure
agreed
understood
reasons
raids
flying
ships
minimizing
abducted
subjects
forth
anger
abducting
emotions
originate
justin
responsible
locating
base
impact
stopping
past
site
remind
proceed
gather
information
interview
witnesses
signs
report
strength
numbers
equipment
form
plan
priority
further
second
abductees
homes
third
hammered
large
metal
goblet
leave
gentlemen
provinces
watch
skies
quietly
tidying
outer
appearances
shaken
rumors
confused
gave
credence
assumed
brigands
flashier
collateral
damage
children
knows
may
fledgling
psychic
trained
psychics
power
telekinesis
range
communications
limited
communicate
raw
emotion
draft
animals
farming
perhaps
vowed
develop
possible
experiment
dry
hop
accomplished
using
nonpsychic
techniques
worthless
bedtime
try
sleep
mental
energy
free
arose
rough
rinsed
tiptoed
cheese
nearby
wooded
area
often
listen
followed
noises
heard
identifiable
local
flora
fauna
regular
swooshing
filtering
skittering
six
dug
forest
floor
tittering
four
wings
dodged
couple
hours
favorite
spot
rock
formed
natural
sit
whether
bubbled
stones
pleasing
gurgling
stilled
moments
learned
exercise
talent
organized
physically
effort
mentally
yesterday
sweeping
hearth
castles
pits
constrain
telekensis
solid
objects
determined
intrigued
pebble
grand
scale
mindtwisting
captured
hopper
jumping
gymnastics
object
clean
servants
picked
maintain
hovering
above
broadly
shot
random
direction
loud
thunk
noise
surprised
cause
searched
general
embedded
send
wherever
faster
sent
boulders
developed
gotten
direct
overhead
famished
opened
lunch
moldy
fuzzy
spots
threw
funny
aged
tartness
hardy
mundane
routines
weak
mornings
exercises
lay
minute
regain
closed
mans
dwelling
adjusted
fires
candles
lights
adjust
curtain
interior
darker
leading
hopefully
committed
memory
both
halfway
hazy
forms
shapes
creepy
flashlight
lamp
cellphone
screen
stick
love
bent
eerie
greenish
freely
figured
completely
amaze
sing
song
voice
begun
shaman
words
brightened
lifted
chanting
spread
gyrate
quiet
lowered
remained
everywhere
pockets
brighter
twinkling
stars
distracted
notice
ceiling
inches
reflected
spookiness
whole
startled
badly
backward
knocking
focused
surge
curiosity
disbelieved
hello
stranger
sorry
mistreated
communication
minds
investigating
capability
yours
lifetime
enable
emotional
symbolic
subcontext
transmitted
telepathically
spoken
fully
speak
higher
rate
final
chant
johns
temples
faded
outside
blinding
relief
captors
standing
taller
100
pounds
strangely
wise
likes
guard
proof
staring
talking
tie
march
barbarian
blankly
guess
complex
slapped
escort
captive
wished
question
starving
supper
wandered
whiff
delicious
scent
bacon
smells
tasty
meats
investigation
source
roasting
spit
hot
coals
hungry
examination
biggest
number
critters
4
hunger
meat
haste
lady
promptly
godforsaken
blank
stare
scowl
basket
fill
belly
handed
patches
mold
grimaced
substantial
hunk
chewed
swallowed
bite
swallow
realized
give
twang
weird
anyway
grain
analog
wheat
moms
cooking
chili
enchilada
pie
figure
brain
driven
threat
search
fates
delivered
extra
contemplating
soundslike
locals
owed
camp
five
stopped
stumpy
plant
single
bloom
flower
plucked
sniffed
nearly
incredibly
ammonia
nutmeg
lemons
boiled
burned
bag
strap
hung
plants
within
eyesight
nightfall
picking
smiling
tricked
reaching
pluck
pointing
sixlegged
creature
dagger
belt
aimed
overhanded
throw
knife
neatly
retrieve
brings
continued
meandering
sunken
returned
led
darkened
pit
cast
magical
planetarium
shelves
books
jars
lots
unidentifiable
glass
earthenware
opaque
fit
sort
gathered
garlands
hang
peoples
necks
leis
welcome
hawaii
cultivated
perfume
household
cleanser
ajax
comet
bleach
ceremony
peyote
ceremonies
plains
quest
closest
type
offered
joint
stands
football
months
ago
visions
altered
smoke
weed
motioned
mortar
pestle
shelf
carved
marble
bowl
size
cereal
chicken
drumstick
pulp
consistency
noted
contents
wooden
handful
add
teacher
dump
puzzled
added
ah
continue
crush
difficult
stuck
sides
smashed
mush
satisfied
scape
touched
crushing
starting
bossed
frustrated
presented
inspection
peered
near
pouch
neck
wondered
inhaled
flames
sneezed
caused
double
momentarily
crackling
whooshing
snuff
doubted
leap
suggested
potent
tobacco
paying
barked
knuckles
side
yelp
motion
offering
sack
finishing
job
finish
friend
geography
kinds
working
beef
jerky
select
surely
practical
joke
trusted
anyone
brutes
force
marched
bitter
pickle
nail
polish
train
kid
nails
sucking
thumb
bought
suck
evidently
buds
disconnected
wake
liked
quit
painting
tying
weeks
awful
mate
college
lover
later
enjoyable
chew
foot
finished
proud
paste
corked
vessel
jar
cork
purposed
uncorked
jug
alcohol
stirred
slurry
worth
fancy
pueblo
center
aflame
heat
impressive
frigid
freezing
chest
insides
surrounding
joking
fear
cannibals
main
soon
earlier
carrying
mounted
turn
order
portion
based
seniority
confusing
guest
prisoner
juicy
drinking
saliva
encourage
complete
chewing
silence
bones
stomach
lie
crazy
hiked
prairie
barbarians
tediously
wonder
elixir
referring
concoction
worked
stupid
hoping
forgotten
stuff
spilling
prepare
twice
familiar
nonetheless
speed
landed
grassy
field
gentle
breeze
fluffing
sunshine
beckoning
child
tall
crown
heads
created
forward
ghosts
experiments
afar
harnessed
glimpse
possibilities
potential
guidance
dangerous
guide
route
monitor
probe
journey
practice
suggesting
physic
women
operating
mentor
abilities
chosen
ladies
alien
stonehenge
nodded
acknowledgement
ourselves
representatives
ours
changes
neither
evil
nor
aim
utilize
own
purposes
degrading
planets
biosphere
seek
believed
drive
newly
support
pledge
use
gifts
protecting
ravages
technologies
gilded
fulfill
destiny
unconscious
state
unable
willfully
gaze
witnessed
scene
science
fiction
grander
star
sailing
void
space
battleships
cities
spacesuits
gigantic
mechanical
robots
city
sized
millions
coordinated
societies
joys
discovery
wonders
beauty
living
condition
thriving
desert
society
individual
citizens
peace
utopia
downfall
annihilated
nuclear
explosions
battles
plummet
cries
mothers
fathers
attack
decimate
innocent
pleading
screams
remorse
wept
tears
happy
soul
squeezed
twisted
wars
ended
civilizations
rebuilt
healed
period
rebirth
civilization
equals
artificially
intelligent
cyborgs
biological
counterparts
desperate
previous
peak
civilisation
price
resources
resource
maintaining
maintained
wiped
loss
certain
amount
humanity
penalties
cooperating
following
swift
harsh
willing
participants
criticize
family
members
part
serve
government
blossomed
accomplish
unimaginable
perfected
teleport
distant
galaxy
medical
extend
thousand
years
technological
unclear
cyborg
arisen
level
unimportant
mattered
provide
elected
empire
shocked
awakened
responsibility
worry
finding
killed
numb
monkey
breath
electrical
pee
laid
extremely
warmed
headache
sitting
liquid
moisten
shrink
gotta
russian
race
expression
expressing
sentiment
simpler
privy
toilet
hillside
outhouse
outhouses
seat
buckets
gourd
bucket
paper
countries
sears
roebuck
catalogs
newspapers
apply
thats
afterward
proper
shake
wiping
poop
rinse
scrape
disgusting
stranded
revision
list
business
elimination
influence
parlor
trick
smoked
crowd
terrorists
sneak
buzz
concert
opposite
seeing
future
advance
begin
view
flush
television
interpretation
actual
events
detail
heights
languished
climb
ladder
discuss
shown
visitor
dumb
spaceports
computers
journeyed
billions
reduced
rebuild
matters
dying
except
seems
whimpering
whining
blubbering
assistant
butt
bathroom
stroked
farted
impossible
start
streamed
cheeks
burst
subsided
exhausted
stressed
system
troubled
ways
shame
clouds
loving
embarrassed
humble
mostly
expectantly
forever
finally
emerging
restored
prevent
outbreak
machine
reaction
laugh
notion
oldest
book
soothsayers
fortune
tellers
tarot
card
readers
resorted
extrapolate
compute
probability
nobody
glimpsed
hidden
truly
waited
interpret
symbolically
jungian
freudian
lets
represents
represented
mysterious
rebuilding
married
setting
nap
unlike
regretted
unanswered
wrapping
hurrying
listened
chasing
increased
pace
outrun
yell
flank
shadows
foul
sending
flew
sizzling
attacker
rewarded
exhilarated
fended
attackers
defend
slowed
confident
dusk
cloth
entering
explain
collected
quarters
shared
woman
named
rye
wicked
grin
blushed
dalliance
parasite
feed
true
harshly
jibe
lightly
plenty
stable
boys
starts
tomorrow
blew
removed
sleepy
ignore
action
questions
hone
sign
message
tiredness
dreamless
forsaken
wounded
navigator
alive
barely
navigate
twisting
interstellar
functioning
nowhere
battle
casualties
performed
controlled
crash
landing
surveyed
systems
repairable
advanced
ftl
communicator
signal
beacons
navigation
johnson
pounded
repair
fuel
replace
fueling
perseverance
roughest
bribed
abduct
individuals
promising
panned
date
skilled
strong
specialized
constructing
bend
svenson
guild
talented
perform
smallest
gravely
moral
problems
candidates
trainable
aye
importance
depended
experienced
losses
battleship
leads
progressing
adams
gaunt
younger
news
mountains
ore
bringing
refining
refinery
failed
slave
labor
dig
transport
requiring
harvest
population
nagging
beyond
shitting
sleeping
recruiting
does
im
heading
contribute
repairs
spare
parts
carried
plus
repurposing
ingenuity
nominal
status
minimal
conserve
repairing
hull
addition
digging
forging
facility
plates
means
forge
james
matt
weary
haul
tremendous
pool
harbored
regrets
enslaving
populace
kids
peers
situations
measures
leaving
difficulties
obstacles
theories
age
quickening
cushions
dish
top
oily
ate
hygienic
approach
assigning
coevolved
names
convey
cimeron
native
understanding
concepts
communicated
translated
sounds
written
reluctant
reacted
strongly
statement
literate
compliments
chef
grunted
contest
fastest
simpleton
speech
blame
uncivilized
appeal
pull
weight
hairy
grinding
hallucinogenic
fellow
slept
skin
rug
soundly
weave
static
images
overall
rested
nudge
smelly
booted
vantage
boots
trudge
chilly
creeping
moaned
stretched
relieving
surprise
primitives
behavior
rub
available
privacy
bathed
bear
itch
stench
command
guessed
wife
selected
wear
undressed
folded
neat
pile
thrown
crude
pants
seams
overlapped
undergarment
correction
supposed
wrap
underwear
arrangements
impatient
settled
arrangement
chafing
waste
ties
cinch
shirt
leather
attached
tight
gate
chuckled
town
sentences
communicating
belittle
patted
legged
mount
saddle
reins
catapulting
backs
nervous
wont
tapped
slid
slip
looser
balance
horn
commands
pack
relaxed
worrying
directed
uh
shrugged
irritated
enjoy
scenery
landscape
dirt
road
puzzling
worrisome
example
smaller
niche
insects
bees
wasps
flies
learning
jet
shuttle
saucer
disappeared
hills
explosion
altogether
ached
terribly
shaky
gripping
cross
round
cigar
bulge
gear
windows
gray
reflective
civilized
faring
bunch
prime
directive
federation
trek
automatic
werent
crappy
trail
beads
device
orbit
wish
streaming
hollow
ache
sobbed
examine
walls
surfaces
angles
square
rounded
dr
seuss
angular
construction
sink
antique
blanket
zapped
unconsciousness
cup
whits
pause
dehydrate
grandparents
farm
act
drawing
contributed
enjoyment
lid
50
gallon
drum
watery
lower
chain
decreased
submerge
sometimes
pretend
fishing
tug
submersed
anticipation
dipper
lovely
handle
lift
comforted
idyllic
evolution
constraints
engineering
designs
tapered
cylinder
designing
requirements
cost
organisms
items
copied
improvements
functional
conclusion
decoration
icing
cake
tend
greatly
design
discarded
intended
womens
heels
exceptions
designed
differently
fastened
covering
assuming
gravity
bets
artificial
subject
minor
perturbations
fastening
uniformed
uniform
jumpsuit
underclothing
examined
comfortable
socks
soles
sandals
gibberish
note
accompanying
transmission
frowned
shoulders
arbitrary
gesture
relationship
gestured
entered
planned
misbehaved
mistreating
rebel
hallways
identify
chairs
cart
case
skullcap
electrodes
computer
detector
electroencephal
electrocuting
prisoners
ambushed
trusting
cap
grabbing
picture
dropped
teaching
telepaths
switch
tingle
pictures
noting
brainwaves
showing
watching
progress
pocket
fiddled
routine
tingles
nauseous
speeding
crowned
affect
unattractive
stale
daylight
block
growing
yourself
hook
appreciate
impolite
manners
pass
bravely
softly
footsteps
ashamed
flushed
excited
desired
pair
childless
considerable
event
bark
boulder
cottage
crowded
endless
garden
husband
gurgle
flowed
advantage
glint
sunlight
sigh
intently
results
exasperation
evaporate
telekenetically
silly
circles
flat
grow
bank
wrong
calm
ripples
calming
curled
uncurled
toes
concentrating
grew
breadths
wide
hopped
balls
clapped
levitate
fish
kiss
flyer
zipped
bubble
trapped
underwater
causing
concentric
studied
subsequent
shorter
nature
grasp
splash
revive
farther
ten
patterns
encounter
somebody
sharing
telekenetics
affecting
builders
sculpture
houses
loner
jealous
incident
detour
cooked
opportunity
itself
honest
magnificent
laborers
materials
fifty
cozy
mending
garment
warmly
greet
hug
facing
fine
ive
havent
arent
share
darling
brother
jeremy
subjected
edgewise
unappreciated
handsome
telekentic
fling
flung
ripple
colleges
dear
fiddling
foolish
notions
forget
finds
plug
listening
squarely
crowns
structure
arranged
warned
behave
stupidity
aside
nonsense
sighed
dutifully
drew
fields
tavern
bragging
son
bragged
complained
goodbyes
angry
treated
supportive
wiggle
ears
appreciated
madder
absolutely
meals
visits
breaks
whichever
silent
escorted
locked
budge
rattling
answered
pounding
sensory
perception
reply
wishing
escape
option
drifted
enslaved
mine
refine
crashed
enslavement
throughout
perspectives
views
negative
visionlike
torn
settlement
capture
grueling
games
related
families
fiercely
sick
charge
manipulate
poor
despair
nightmares
awaking
fifth
capturing
clue
session
charles
jenni
surprising
venom
suppose
consider
treatment
thanks
sarcastically
sold
extreme
position
saved
slavery
contained
plight
paused
collect
remains
crew
damaged
disabled
needs
worthy
breaches
refuel
spell
drives
theory
concept
inkling
amateur
radio
operators
license
waves
weld
ill
iron
steel
arc
welder
acetylene
torch
refueling
pump
concern
expect
fix
although
tells
capable
areas
indicated
respect
existence
belonged
highly
technically
cant
encouraged
willingly
morally
immoral
goal
helping
justify
address
issue
upstanding
greater
defending
concerns
keeping
overworking
exhaustion
kidnapping
coercing
becoming
depressed
separated
suicide
inexcusable
jennis
unhappy
handled
weighing
deaths
versus
training
examining
math
physics
required
largest
astrophysics
lifting
education
calculations
manually
educated
sciences
possess
test
ability
figures
reading
witch
doctors
adjustment
uses
speeds
engine
amplifier
wow
blown
esp
broadcast
amplify
phenomenon
unaided
occasions
demonstration
injuries
stabilize
warp
reliably
transfer
risked
bits
unstable
wormhole
afford
including
38
manage
operations
operate
role
liason
inhabitants
smooth
disagree
treating
forcing
solution
introduce
candidate
essence
peaceably
resort
drastic
manner
mission
abductions
departed
attempting
track
interact
detect
signals
narrowing
increasing
south
refuge
towns
villages
crystal
belongings
packed
knives
pay
lodging
cared
immensely
drawn
repelled
experimenting
princesses
jewelry
pieces
stashed
pantry
princesss
painfully
rouse
interest
guards
girls
unnoticed
hardest
risk
waking
boxes
dim
box
detached
roused
damn
whisper
underhanded
sunrise
uneducated
stealing
shout
palace
redhanded
success
fathom
ring
hey
stephanie
serving
hush
pressure
imagination
losing
kindled
invoked
telekenetic
sight
stephanies
definite
incredulity
flatly
exciting
save
slower
agree
yay
bounced
ball
gowns
sensible
stash
unaware
accustomed
nightgown
totally
nude
envious
slender
breasts
sixteen
matured
quicker
shall
daughter
wasn
t
didn
lean
couldn
wouldn
grandfather
s
hadn
don
d
non
mom
m
re
purposing
co
evolved
won
weren
ve
haven
aren
ll
wasting
valuable
ignoring
backtracked
stables
safer
urrr
growled
kings
banquet
gathering
thong
aid
sorceresses
detected
contacted
eh
calling
william
dang
stomped
mare
straw
levitated
shooting
amazing
readying
sergio
verbal
stabs
flirting
grinning
rather
dungeon
adventurers
aircraft
carrier
exterior
sections
missing
melted
edges
discoloration
submarine
knocked
breathy
aback
matched
invoke
pity
tubes
wires
caved
gawked
gawking
traveller
injured
navigators
audible
wheeze
ages
5
mature
process
teleporting
magnifies
tenfold
searching
struck
chaff
unbiased
description
artistic
likeness
located
untrained
guilds
ruins
manipulation
learns
gets
ingrained
cute
shape
roy
cruel
master
inaudible
efforts
slaves
voluntarily
multiple
levels
deeper
trouble
advertise
worker
unwilling
ideas
midst
spokesperson
volunteer
negotiation
gain
disagreed
plausible
revenge
forgive
thoughtfully
recompense
value
negotiations
shiny
payment
vast
tracts
valued
mussel
shell
aha
rotten
curve
establishing
blocks
benefit
convince
snapped
fingers
hate
upward
religion
vulnerable
rises
sets
god
ores
create
convincing
displays
whenever
pray
prayers
intermediary
spiritual
kidding
explains
centuries
advancing
undoing
scheme
testing
common
mines
gee
rode
raiders
invasion
overcome
trio
north
dismount
clashed
invaded
roar
engines
terrifying
hiding
disgust
warn
fool
detecting
climbed
prodded
onward
disgusted
infatuation
predicted
hid
faced
northward
silhouette
dawn
sneaking
ridden
riders
inn
inviting
bustling
sticking
flashed
outnumbered
wisdom
stew
settle
miles
idly
folksong
hill
turns
upside
repeated
stress
confirmed
comfort
scattered
twenty
ranging
seven
twelve
memorize
becomes
memorizing
unbelievable
parents
play
lithe
hi
kneeled
sophia
whispered
newcomer
raid
deepen
gold
wanting
strengthened
conviction
board
weekends
grievous
trespass
someones
unforgivable
gazing
bowls
curious
says
perfectly
centered
telekenesis
waters
dimensional
distorted
dimension
visualize
warping
studying
immerse
complexities
study
emoted
dumbstruck
imagining
coerce
paralyzed
indecision
included
madness
jon
luck
bindings
member
oversaw
overseer
fenced
fence
punished
assignment
certainly
agreement
barrel
dan
hodgepoint
captain
stark
raving
severely
truthful
skill
unlocked
cooperate
fighting
resist
punish
hurting
mark
touch
draw
spokesman
negotiate
reparations
fits
torture
safe
blighted
smacked
meaty
fist
wrongs
tables
overnight
stage
travelled
solve
rooms
inns
witches
chase
humdrum
midday
briefly
swaying
creating
cakes
fermented
beverage
odd
forbidden
affection
company
useful
protection
lovebirds
played
precisely
adding
complexity
tightened
deforming
sideways
intertwine
contortions
climax
contortion
fabric
spacetime
rippled
crest
amazed
seriously
shock
sculptures
happend
reflection
toss
optical
illusion
fruits
blocked
exhaled
exhale
apart
concentration
fruit
uttered
cry
amazement
excitement
realize
drained
companions
swooned
gently
cleaned
conditions
strenuous
lighting
pumps
circulated
electric
hauled
vehicles
tracks
jackhammers
smash
sprayed
plastic
concrete
unfamiliar
captives
ease
finer
points
demanding
smart
easier
seal
pushing
buttons
explaining
naturally
argument
fight
win
fair
faked
promise
upper
injury
justly
hesitantly
tough
befriended
friendship
advice
lesson
convicted
however
chipping
ozone
hammer
constant
banging
compromise
gulp
file
gun
miserable
yeah
sunburns
claws
wives
yapping
snotty
noses
wipe
unconvincing
rail
car
sunup
til
sundown
tap
woken
slack
stout
punch
defense
squinted
silhouetted
promised
bested
allow
received
thankful
minimize
foolhardy
collided
momentum
drove
bravado
exchanged
gist
replayed
current
unfold
charged
adrenaline
bloodstream
lava
sidestepped
agile
fists
taunt
instruction
fought
unleash
hesitated
swung
broken
connected
incoming
backwards
stumble
underneath
decide
punches
unexpected
unprepared
catch
planted
seized
stooped
professional
wrestling
nelson
resistance
futile
submit
emoting
overtime
intentions
screw
moves
lake
torso
upwards
slammed
submission
previously
cheered
cheering
rooting
underdog
devil
bruises
rear
winded
result
combined
wronged
warped
rescued
curvy
ordinary
dusty
teleported
activity
regained
savory
odors
thick
herbs
flavor
hearty
stomachs
restore
seconds
retired
customary
territory
vividly
queen
beloved
honor
wave
peasants
crying
pulling
sniffled
lied
pleaded
dread
commanded
shattered
adults
camps
ghost
confession
pleas
desperation
kidnappings
bending
false
pretenses
projecting
trip
gosh
thinks
determine
asking
volunteered
portal
magic
chopped
ridiculous
insane
corrected
month
goose
sustain
trade
service
steal
sinking
shortly
enter
represent
exposure
ordered
elect
nominate
comment
approved
representative
succeed
content
gained
appease
thoughtful
punishment
physical
shafts
metals
provided
acceptable
bargain
chemistry
metallurgy
electronics
isn
doable
programs
rudimentary
acting
oversee
intensive
program
present
consensus
meantime
agreeable
dreaded
managing
grumbled
forgiven
beaten
reminded
serious
disadvantage
overpower
offer
rotations
larger
mountain
curves
rapidly
screaming
urge
surrender
hatch
armed
sticks
ushered
instructed
seats
scanned
scanner
scanning
assigned
wheezed
fetch
visited
translator
escorts
surveying
possibly
allotted
granted
access
rewards
pleasure
feedback
stated
health
basics
mathematics
unified
explained
forces
progressed
fantastic
elevated
sweating
profusely
flooding
requested
stimulants
caffeine
cocaine
reluctantly
flood
screamed
absorbing
umbilical
mesh
initially
engineers
tens
thousands
floods
craved
absorb
craving
assimilation
addictive
drug
astrophyics
quantum
mechanics
endure
assign
isolated
tech
community
repaired
globe
relished
possibility
exploring
hinge
luring
timid
trips
figurative
crank
reward
maximum
reattached
wiring
parameters
activated
alternating
sweat
poured
forehead
grasped
muscle
ceased
bearings
console
surrendered
disconnect
amplifiers
shows
immersion
senses
recognition
puzzlement
glancing
intentionally
boggles
ignored
justice
deserve
assured
exchange
harness
destroy
explore
cosmic
launch
bond
translate
sole
goes
fluently
winning
proposal
proposing
grudge
increase
output
claim
translating
demonstrated
vote
planning
harder
sampling
confiding
kick
fluent
perceived
accepted
insisted
logic
mining
organize
sniffle
strings
manipulator
scrubbing
floors
wild
sacrifice
puppy
dog
batted
eyelashes
unison
cringed
unfair
nursemaid
pathetic
peeked
backup
makes
adult
determination
hugs
freeing
fired
visible
plume
cloud
doesn
announce
voluntary
alternate
join
clamp
voting
overruled
fodder
cooperative
poker
dreading
overtake
upgrades
accelerated
housed
hushed
whispers
unleashed
frail
deteriorating
posses
primary
spending
humbly
takes
manipulated
beings
awake
sleepwalking
doubt
fail
looks
evidence
possesses
patched
voyage
sicker
noisy
labored
filed
silently
hallway
insist
remain
galactic
risks
accelerate
specialists
major
boosts
thrive
receive
modest
smelt
tools
heal
drought
resistant
volunteers
accompany
30
specialty
theirs
enslave
kidnap
prevail
inspire
soak
relate
groups
deny
failure
suspect
rebellion
consequences
perceive
released
hell
jake
sicknesses
babies
prevented
sickness
toil
ends
nicer
dissenter
speck
drops
crops
bitch
shitty
suffering
bastards
rationally
exit
blocking
jaw
rocked
sprang
rushed
throat
kneed
abdomen
loosen
slipped
skirmish
overpowered
scream
temple
wakes
amiss
gag
dirty
frickin
weigh
trivial
understands
portray
elsewhere
involved
confidence
barbaric
boost
underway
translation
expressed
disagreement
interfere
giving
honing
outcome
frenzied
fueled
introduced
hundreds
secretly
environmental
propulsion
ounce
willpower
tilt
prolonged
invaluable
tactics
hooked
subtleties
folding
gauge
exact
instructions
infinite
finite
destination
check
endangering
bloodless
coup
accomplishing
aboard
minimum
separate
skirmishes
vanished
instantaneously
ear
insured
shipwide
intercom
actions
smoothly
scenes
takeover
bridge
